export const PERFECTIVE_GERUND = ['в', 'вши', 'вшись',
    'ив', 'ивши', 'ившись', 'ыв', 'ывши', 'ывшись'
]
export const ADJECTIVE = [
    "ее",
    "ие",
    "ые",
    "ое",
    "ими",
    "ыми",
    "ей",
    "ий",
    "ый",
    "ой",
    "ем",
    "им",
    "ым",
    "ом",
    "его",
    "ого",
    "ему",
    "ому",
    "их",
    "ых",
    "ую",
    "юю",
    "ая",
    "яя",
    "ою",
    "ею"
];

export const PARTICIPLE = [
    "ем", "нн", "вш", "ющ", "щ",
    "ивш", "ывш", "ующ"
];

export const REFLEXIVE = ['ся', 'сь'];

export const VERB = [
    'ла', 'на', 'ете', 'йте', 'ли', 'й', 'л', 'ем', 'н', 'ло', 'но', 'ет', 'ют', 'ны', 'ть', 'ешь', 'нно',
    'ила', 'ыла', 'ена', 'ейте', 'уйте', 'ите', 'или', 'ыли', 'ей', 'уй', 'ил', 'ыл', 'им', 'ым', 'ен', 'ило', 'ыло', 'ено', 'ят', 'ует', 'уют', 'ит', 'ыт', 'ены', 'ить', 'ыть', 'ишь', 'ую', 'ю'
]

export const NOUN = [
    "а",
    "ев",
    "ов",
    "ие",
    "ье",
    "е",
    "иями",
    "ями",
    "ами",
    "еи",
    "ии",
    "и",
    "ией",
    "ей",
    "ой",
    "ий",
    "й",
    "иям",
    "ям",
    "ием",
    "ем",
    "ам",
    "ом",
    "о",
    "у",
    "ах",
    "иях",
    "ях",
    "ы",
    "ь",
    "ию",
    "ью",
    "ю",
    "ия",
    "ья",
    "я"
];

export const SUPERLATIVE = ["ейш", "ейше"];
export const DERIVATIONAL = ["ост", "ость"];

export const VOWELS = ['а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я']
export const CONSONANTS = ['б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ь']